chgpalmer/zephyr-hal-artery/include/dt-bindings/clock/at32f403a_407-clocks.h
/*
 * Copyright (c) 2022 Teslabs Engineering S.L.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F403_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F403_CLOCKS_H_

#include "at32-clocks-common.h"

/**
 * @name Register offsets
 * @{
 */

#define AT32_AHBEN_OFFSET        0x14U
#define AT32_APB1EN_OFFSET       0x1CU
#define AT32_APB2EN_OFFSET       0x18U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB peripherals */
#define AT32_CLOCK_DMA1       AT32_CLOCK_CONFIG(AHBEN, 0U)
#define AT32_CLOCK_DMA2       AT32_CLOCK_CONFIG(AHBEN, 1U)
#define AT32_CLOCK_SRAM       AT32_CLOCK_CONFIG(AHBEN, 2U)
#define AT32_CLOCK_FLASH      AT32_CLOCK_CONFIG(AHBEN, 4U)
#define AT32_CLOCK_CRC        AT32_CLOCK_CONFIG(AHBEN, 6U)
#define AT32_CLOCK_XMC        AT32_CLOCK_CONFIG(AHBEN, 8U)
#define AT32_CLOCK_SDIO1      AT32_CLOCK_CONFIG(AHBEN, 10U)
#define AT32_CLOCK_SDIO2      AT32_CLOCK_CONFIG(AHBEN, 11U)
#define AT32_CLOCK_EMAC       AT32_CLOCK_CONFIG(AHBEN, 14U)
#define AT32_CLOCK_EMACTX     AT32_CLOCK_CONFIG(AHBEN, 15U)
#define AT32_CLOCK_EMACRX     AT32_CLOCK_CONFIG(AHBEN, 16U)
#define AT32_CLOCK_EMACPTP    AT32_CLOCK_CONFIG(AHBEN, 17U)

/* APB1 peripherals */
#define AT32_CLOCK_TMR2       AT32_CLOCK_CONFIG(APB1EN, 0U)
#define AT32_CLOCK_TMR3       AT32_CLOCK_CONFIG(APB1EN, 1U)
#define AT32_CLOCK_TMR4       AT32_CLOCK_CONFIG(APB1EN, 2U)
#define AT32_CLOCK_TMR5       AT32_CLOCK_CONFIG(APB1EN, 3U)
#define AT32_CLOCK_TMR6       AT32_CLOCK_CONFIG(APB1EN, 4U)
#define AT32_CLOCK_TMR7       AT32_CLOCK_CONFIG(APB1EN, 5U)
#define AT32_CLOCK_TMR12      AT32_CLOCK_CONFIG(APB1EN, 6U)
#define AT32_CLOCK_TMR13      AT32_CLOCK_CONFIG(APB1EN, 7U)
#define AT32_CLOCK_TMR14      AT32_CLOCK_CONFIG(APB1EN, 8U)
#define AT32_CLOCK_WWDT       AT32_CLOCK_CONFIG(APB1EN, 11U)
#define AT32_CLOCK_SPI2       AT32_CLOCK_CONFIG(APB1EN, 14U)
#define AT32_CLOCK_SPI3       AT32_CLOCK_CONFIG(APB1EN, 15U)
#define AT32_CLOCK_SPI4       AT32_CLOCK_CONFIG(APB1EN, 16U)
#define AT32_CLOCK_USART2     AT32_CLOCK_CONFIG(APB1EN, 17U)
#define AT32_CLOCK_USART3     AT32_CLOCK_CONFIG(APB1EN, 18U)
#define AT32_CLOCK_UART4      AT32_CLOCK_CONFIG(APB1EN, 19U)
#define AT32_CLOCK_UART5      AT32_CLOCK_CONFIG(APB1EN, 20U)
#define AT32_CLOCK_I2C1       AT32_CLOCK_CONFIG(APB1EN, 21U)
#define AT32_CLOCK_I2C2       AT32_CLOCK_CONFIG(APB1EN, 22U)
#define AT32_CLOCK_USB        AT32_CLOCK_CONFIG(APB1EN, 23U)
#define AT32_CLOCK_CAN1       AT32_CLOCK_CONFIG(APB1EN, 25U)
#define AT32_CLOCK_CAN2       AT32_CLOCK_CONFIG(APB1EN, 26U)
#define AT32_CLOCK_BPR        AT32_CLOCK_CONFIG(APB1EN, 27U)
#define AT32_CLOCK_PWC        AT32_CLOCK_CONFIG(APB1EN, 28U)
#define AT32_CLOCK_DAC        AT32_CLOCK_CONFIG(APB1EN, 29U)

/* APB2 peripherals */
#define AT32_CLOCK_IOMUX      AT32_CLOCK_CONFIG(APB2EN, 0U)
#define AT32_CLOCK_GPIOA      AT32_CLOCK_CONFIG(APB2EN, 2U)
#define AT32_CLOCK_GPIOB      AT32_CLOCK_CONFIG(APB2EN, 3U)
#define AT32_CLOCK_GPIOC      AT32_CLOCK_CONFIG(APB2EN, 4U)
#define AT32_CLOCK_GPIOD      AT32_CLOCK_CONFIG(APB2EN, 5U)
#define AT32_CLOCK_GPIOE      AT32_CLOCK_CONFIG(APB2EN, 6U)
#define AT32_CLOCK_ADC1       AT32_CLOCK_CONFIG(APB2EN, 9U)
#define AT32_CLOCK_ADC2       AT32_CLOCK_CONFIG(APB2EN, 10U)
#define AT32_CLOCK_TMR1       AT32_CLOCK_CONFIG(APB2EN, 11U)
#define AT32_CLOCK_SPI1       AT32_CLOCK_CONFIG(APB2EN, 12U)
#define AT32_CLOCK_TMR8       AT32_CLOCK_CONFIG(APB2EN, 13U)
#define AT32_CLOCK_USART1     AT32_CLOCK_CONFIG(APB2EN, 14U)
#define AT32_CLOCK_ADC3       AT32_CLOCK_CONFIG(APB2EN, 15U)
#define AT32_CLOCK_TMR9       AT32_CLOCK_CONFIG(APB2EN, 19U)
#define AT32_CLOCK_TMR10      AT32_CLOCK_CONFIG(APB2EN, 20U)
#define AT32_CLOCK_TMR11      AT32_CLOCK_CONFIG(APB2EN, 21U)
#define AT32_CLOCK_ACC        AT32_CLOCK_CONFIG(APB2EN, 22U)
#define AT32_CLOCK_I2C3       AT32_CLOCK_CONFIG(APB2EN, 23U)
#define AT32_CLOCK_UART6      AT32_CLOCK_CONFIG(APB2EN, 24U)
#define AT32_CLOCK_UART7      AT32_CLOCK_CONFIG(APB2EN, 25U)
#define AT32_CLOCK_UART8      AT32_CLOCK_CONFIG(APB2EN, 26U)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_AT32F403_CLOCKS_H_ */
